In [69]:
import pandas as pd
train = pd.read_csv('C:/Users/Nurtilek/Downloads/titanic/train.csv')
test = pd.read_csv('C:/Users/Nurtilek/Downloads/titanic/test.csv')

In [70]:
y = train['Survived']
X = train.drop(['Survived'], axis = 1)

In [71]:
X.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [72]:
X.drop(['Name', 'Ticket', 'Cabin'], axis = 1, inplace = True)
test.drop(['Name', 'Ticket', 'Cabin'], axis = 1, inplace = True)

In [73]:
X.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1       3    male  22.0      1      0   7.2500        S
1            2       1  female  38.0      1      0  71.2833        C
2            3       3  female  26.0      0      0   7.9250        S
3            4       1  female  35.0      1      0  53.1000        S
4            5       3    male  35.0      0      0   8.0500        S

In [74]:
test.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0          892       3    male  34.5      0      0   7.8292        Q
1          893       3  female  47.0      1      0   7.0000        S
2          894       2    male  62.0      0      0   9.6875        Q
3          895       3    male  27.0      0      0   8.6625        S
4          896       3  female  22.0      1      1  12.2875        S

In [75]:
X_embarked_dummies = pd.get_dummies(X.Embarked)
X_sex_dummies = pd.get_dummies(X.Sex)
X = pd.concat([X, X_embarked_dummies, X_sex_dummies], axis=1)
X.drop([ 'Sex', 'Embarked'], axis = 1, inplace = True)

In [76]:
test_embarked_dummies = pd.get_dummies(test.Embarked)
test_sex_dummies = pd.get_dummies(test.Sex)
test = pd.concat([test, test_embarked_dummies, test_sex_dummies], axis=1)
test.drop([ 'Sex', 'Embarked'], axis = 1, inplace = True)

In [77]:
X.head()

   PassengerId  Pclass   Age  SibSp  Parch     Fare  C  Q  S  female  male
0            1       3  22.0      1      0   7.2500  0  0  1       0     1
1            2       1  38.0      1      0  71.2833  1  0  0       1     0
2            3       3  26.0      0      0   7.9250  0  0  1       1     0
3            4       1  35.0      1      0  53.1000  0  0  1       1     0
4            5       3  35.0      0      0   8.0500  0  0  1       0     1

In [78]:
test.head()

   PassengerId  Pclass   Age  SibSp  Parch     Fare  C  Q  S  female  male
0          892       3  34.5      0      0   7.8292  0  1  0       0     1
1          893       3  47.0      1      0   7.0000  0  0  1       1     0
2          894       2  62.0      0      0   9.6875  0  1  0       0     1
3          895       3  27.0      0      0   8.6625  0  0  1       0     1
4          896       3  22.0      1      1  12.2875  0  0  1       1     0

In [79]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Pclass       891 non-null    int64
 2   Age          714 non-null    float64
 3   SibSp        891 non-null    int64
 4   Parch        891 non-null    int64
 5   Fare         891 non-null    float64
 6   C            891 non-null    uint8
 7   Q            891 non-null    uint8
 8   S            891 non-null    uint8
 9   female       891 non-null    uint8
 10  male         891 non-null    uint8
dtypes: float64(2), int64(4), uint8(5)
memory usage: 46.2 KB

In [80]:
X.Age.fillna((X.Age.mean()), inplace=True)

In [81]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Age          332 non-null    float64
 3   SibSp        418 non-null    int64
 4   Parch        418 non-null    int64
 5   Fare         417 non-null    float64
 6   C            418 non-null    uint8
 7   Q            418 non-null    uint8
 8   S            418 non-null    uint8
 9   female       418 non-null    uint8
 10  male         418 non-null    uint8
dtypes: float64(2), int64(4), uint8(5)
memory usage: 21.8 KB

In [82]:
test.Age.fillna((test.Age.mean()), inplace=True)
test.Fare.fillna((test.Fare.median()), inplace=True)

In [83]:
from sklearn.model_selection import train_test_split
X_train, X_val, y_train, y_val = train_test_split(X, y, test_size=0.3)

In [112]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import GridSearchCV
import numpy as np
model = RandomForestClassifier()
n_estimators = [int(x) for x in np.linspace(start = 100, stop = 1000, num = 10)]
max_features = [int(x) for x in np.linspace(1, 7, num = 2)]
max_depth = [int(x) for x in np.linspace(1, 20, num = 2)]
max_depth.append(None)
min_samples_split = [2, 5, 8]
random_grid = {'n_estimators': n_estimators,
               'max_features': max_features,
               'max_depth': max_depth,
               'min_samples_split': min_samples_split}

In [113]:
rf_random = GridSearchCV(estimator = model, param_grid = random_grid, scoring = "accuracy", cv = 3, verbose=2, n_jobs = -1)
rf_random.fit(X_train, y_train)
rf_random.best_params_

Fitting 3 folds for each of 180 candidates, totalling 540 fits

[Parallel(n_jobs=-1)]: Using backend LokyBackend with 12 concurrent workers.
[Parallel(n_jobs=-1)]: Done  17 tasks      | elapsed:    2.1s
[Parallel(n_jobs=-1)]: Done 138 tasks      | elapsed:   16.4s
[Parallel(n_jobs=-1)]: Done 341 tasks      | elapsed:   40.1s
[Parallel(n_jobs=-1)]: Done 540 out of 540 | elapsed:  1.1min finished

{'max_depth': 20,
 'max_features': 7,
 'min_samples_split': 8,
 'n_estimators': 100}

In [114]:
from sklearn.metrics import mean_squared_error
forest = RandomForestRegressor(n_estimators = 100, max_depth=20, min_samples_split=8, max_features=7 )
model.fit(X_train, y_train)
forest_predictions = model.predict(X_val)
print(mean_squared_error(y_val, forest_predictions, squared=False))

0.43193421279068006

In [118]:
from sklearn.metrics import accuracy_score
accuracy_score(y_val, forest_predictions)

0.8134328358208955

In [115]:
submit=pd.DataFrame()
submit['PassengerId'] = test['PassengerId']
submit['Survived'] = model.predict(test).astype(int)
submit.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         1
4          896         1

In [117]:
submit.to_csv('Nurti_Titanic_3.csv',index=False)